/* 
 * File:   SPI.h
 * Author: Grinev
 *
 * Created on 21 ќкт€брь 2015 г., 15:41
 */

#ifndef SPI_H
#define	SPI_H

#include <GenericTypeDefs.h>

/******************************************************
 * void    SPI_Init(void)
 * »нициализирует SPI1
 * на 16 битовые посылки
 ******************************************************/
void    SPI_Init(void);

/*******************************************************
 * void SPI_Put(UINT16 dat)
 * ѕередаЄт в SPI
 * одну посылку
 * —игнал выборки формируем
 * из вызывающей программы
 *******************************************************/
void    SPI_Put(UINT16 dat);


#endif	/* SPI_H */

